export const data = [
    {   
        name: 'S & P',
        title: 'A star and a planet in a circular orbit',
        planets: [{"name":"Sun","m":10000,"r":25,"x":0,"y":0,"vx":0,"vy":0,"color":"yellow"},{"name":"Earth","m":10,"r":8,"x":400,"y":0,"vx":0,"vy":5,"color":"lightblue"}],
        html: `<h1>Створити систему зірка-планета, так щоб планета була на заданій відстані і рухалась по круговій орбіті.</h1>
Вирішення
Щоб планета рухалася по колу навкруги нерухомої зірки, маса планети має бути малою відносно маси зірки. Рух по колу потребує щоб відцентрова сила врівноважувалася силою тяжіння, тобто
(mv^2)/r=G Mm/r^2                        (1.1)
З (1.1) витікає  (1.2).
v=√(GM⁄r)                        (1.2)

Приклад. M = 10^4;    G = 1;    r=400;    v=√(10000⁄400)= 5 .    

    [{"name":"Sun","m":10000,"r":25,"x":0,"y":0,"vx":0,"vy":0,"color":"yellow"},{"name":"Earth","m":10,"r":8,"x":400,"y":0,"vx":0,"vy":5,"color":"lightblue"}]            
`},


    ]