export const data = [
    {   
        name: 'S & P',
        title: 'A star and a planet in a circular orbit',
        planets: [{"name":"Sun","m":10000,"r":25,"x":0,"y":0,"vx":0,"vy":0,"color":"yellow"},{"name":"Earth","m":10,"r":8,"x":400,"y":0,"vx":0,"vy":5,"color":"lightblue"}],
        cond: `Є масивна зірка і планета біля неї. Зробіть так, щоб планета рухалась навкруги зіркі по колу.`,
        help: `Щоб планета рухалася по колу навкруги майже нерухомої зірки, маса планети має бути малою відносно маси зірки.
<p>Рух по колу потребує, щоб відцентрова сила врівноважувалася силою тяжіння, тобто
<p>\\( mv^2/r=G Mm/r^2 \\)
<p> тут M - маса зірки, m - маса планети, r - відстань, v - швидкість планети, G = 1.
<p>З цього витікає  \\( v=\\sqrt{GM \\over r} \\)

<p>Приклад. \\( M = 10^4;    G = 1;    r=400;    v=\\sqrt{10000\\over 400}= 5 \\)
`},


    ]